<?

function get_parent_by_subkat($group) {
//Товары для дома id : 26
$tovari_dlya_doma = array(
    "АКСЕССУАРЫ ДЛЯ ВАННОЙ КОМНАТЫ, ТУАЛЕТА",
    "ВИТАМИННО-МИНЕРАЛЬНЫЕ ДОБАВКИ",
    "ГАЛАНТЕРЕЙНЫЕ ТОВАРЫ",
    "КЛЕЕНКА СТОЛОВАЯ, СКАТЕРТИ",
    "ТОВАРЫ ДЛЯ УБОРКИ",
    "ПЛАСТМАССОВЫЕ ИЗДЕЛИЯ БЕЛАРУСЬ",
    "ПЛАСТМАССОВЫЕ ИЗДЕЛИЯ РОССИЯ",
    "СРЕДСТВА ГИГИЕНЫ",
    "СРЕДСТВА ОТ БЫТОВЫХ НАСЕКОМЫХ",
    "СРЕДСТВА ОТ ГРЫЗУНОВ",
    "ТОВАРЫ ДЛЯ ОТДЫХА",
    "ТОВАРЫ ДЛЯ ДОМА",
    "КУХОННАЯ УТВАРЬ"
);
  

//САД И ОГОРОД id : 8

$sad_i_ogorod = array(
    "ТОВАРЫ ДЛЯ РАССАДЫ",
    "СРЕДСТВА ОТ СОРНЯКОВ",
    "СРЕДСТВА ОТ ВРЕДИТЕЛЕЙ",
    "СРЕДСТВА ОТ БОЛЕЗНЕЙ РАСТЕНИЙ",
    "РЕГУЛЯТОРЫ РОСТА",
    "СЕТКА САДОВАЯ, ДЕКОР",
    "ШЛАНГИ,ФИТИНГИ Д/ПОЛИВА",
    "ХОЗИНВЕНТАРЬ",
    "УКРЫВНОЙ МАТЕРИАЛ",
    "УДОБРЕНИЯ,МИКРОУДОБРЕНИЯ",
    "ОПРЫСКИВАТЕЛИ, ЛЕЙКИ",
    "ЖИДКИЕ УДОБРЕНИЯ",
    "ГРУНТ,ДРЕНАЖ,ТОРФ",
    "ГАЗОН,СЕМЕНА",
    "ВАЗОНЫ,ГОРШКИ,КАШПО",
    "ПРОФЕССИОНАЛЬНАЯ АГРОХИМИЯ",
);
    
// ПОСУДА id : 61

$posuda = array(
    "ПЛАСТИКОВАЯ ПОСУДА",
    "КУХОННАЯ УТВАРЬ",
    "ПОСУДА",
);
    
// ХОЗТОВАРЫ id : 10

$hoztovari = array(
    "ПЛЕНКА П/Э",
    "ПЕЧНОЕ ЛИТЬЁ",
    "ПЕРЧАТКИ,РУКАВИЦЫ",
    "ОЦИНКОВАННЫЕ ИЗДЕЛИЯ",
    "МЕШКИ,ПАКЕТЫ",
    "ХОЗТОВАРЫ"
);
    
// ЭЛЕКТРОТОВАРЫ id : 65

$elektrotovari = array(
    "ЭЛЕМЕНТЫ ПИТАНИЯ",
    "ЭЛЕКТРООБОРУДОВАНИЕ",
    "ЭЛЕКТРОЛАМПЫ",
    "ИЗОЛЕНТА,ЭЛЕКТРОМАТРИАЛЫ"
);
    
// СТРОИТЕЛЬНЫЕ ТОВАРЫ	 id : 66

$stroitelnie = array(
    "ТАЧКИ,КАМЕРЫ,СТРЕМЯНКИ",
    "СТРОИТЕЛЬНЫЕ ТОВАРЫ",
    "СКОТЧ,СТРЕЙЧ",
    "РАСТВОРИТЕЛИ,ОЛИФА",
    "ОБОЙНЫЙ КЛЕЙ",
    "ЛАКИ, КРАСКИ",
    "КЛЕЙ,ГЕРМЕТИК,ПЕНА",
    "КИСТИ,ВАЛИКИ",
    "ИНСТРУМЕНТ"
);
      

    if (in_array ($group, $tovari_dlya_doma)) return 26; //Товары для дома id : 26
    if (in_array ($group, $sad_i_ogorod)) return 8; //САД И ОГОРОД id : 8
    if (in_array ($group, $posuda)) return 61; // ПОСУДА id : 61
    if (in_array ($group, $hoztovari)) return 10; // ХОЗТОВАРЫ id : 10
    if (in_array ($group, $elektrotovari)) return 65; // ЭЛЕКТРОТОВАРЫ id : 65
    if (in_array ($group, $stroitelnie)) return 66; // СТРОИТЕЛЬНЫЕ ТОВАРЫ	 id : 66
}

?>